![image](https://user-images.githubusercontent.com/57321948/196933065-4b16c235-f3b9-4391-9cfe-4affcec87c35.png)

# Business Analytics

## 17 July 2021

## Pandas

In [1]:
import pandas as pd
import numpy as np

In [25]:
pd.read_csv('train.csv')['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [21]:
type(pd.read_csv('train.csv'))

pandas.core.frame.DataFrame

In [20]:
type(pd.read_csv('train.csv')['PassengerId'])

pandas.core.series.Series

In [29]:
type(data_dict)

dict

In [2]:
data_dict = {"names":['A','B','C','D'],"Marks":[1,2,3,4]}

In [3]:
pd.DataFrame(data_dict).to_csv('data_dict.csv',index=False)

In [4]:
df_1 = pd.read_csv('data_dict.csv')

In [5]:
df_1.index = ['m1','m2','m3','m4']

In [6]:
df_1['Marks']['m4'] = 100

/tmp/ipykernel_2209/3862230848.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_1['Marks']['m4'] = 100

In [7]:
df_1[['names']]

   names
m1     A
m2     B
m3     C
m4     D

In [8]:
pd.DataFrame(data_dict).to_csv('my_df.csv',index = False)

In [9]:
data_1 = pd.DataFrame(data_dict)

In [10]:
data_1.index = ['M1','M2','M3','M4']

In [11]:
data_1['Marks']['M1'] = 10

/tmp/ipykernel_2209/3303139757.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_1['Marks']['M1'] = 10

In [12]:
data_1

   names  Marks
M1     A     10
M2     B      2
M3     C      3
M4     D      4

In [13]:
data_1[['names']]

   names
M1     A
M2     B
M3     C
M4     D

In [14]:
rand_df = pd.DataFrame(np.random.rand(2,3))

In [15]:
rand_df.columns = ['A','B','C']

In [16]:
rand_df.index = ['I1','I2']

In [17]:
random_df = pd.DataFrame(np.random.rand(34,5),index = np.arange(34),columns=np.arange(5))

In [18]:
random_df.T

,0,1,2,3,4,5,6,7,8,9,...,24,25,26,27,28,29,30,31,32,33
0,0.408873,0.966075,0.625200,0.764264,0.055418,0.064436,0.162364,0.204036,0.722857,0.655874,...,0.087940,0.411591,0.797402,0.031095,0.691195,0.602075,0.170402,0.394684,0.473905,0.581369
1,0.080148,0.604476,0.949898,0.967682,0.148955,0.405170,0.859095,0.793590,0.053262,0.980545,...,0.514506,0.755843,0.439801,0.811242,0.333192,0.558636,0.411075,0.825703,0.121063,0.848084
2,0.722495,0.723774,0.618637,0.860462,0.953123,0.472755,0.197330,0.457012,0.568450,0.847337,...,0.593723,0.602230,0.696072,0.903321,0.413138,0.920549,0.551609,0.743615,0.975106,0.388928
3,0.841586,0.774487,0.209370,0.060047,0.743903,0.000539,0.650121,0.514447,0.936718,0.481531,...,0.476755,0.690597,0.035736,0.462740,0.599887,0.726632,0.361438,0.115180,0.241134,0.025997
4,0.305969,0.548012,0.351028,0.359093,0.072944,0.771147,0.182077,0.667783,0.571551,0.790807,...,0.677068,0.101611,0.358414,0.413195,0.348240,0.399069,0.174665,0.968541,0.651525,0.896529

In [19]:
random_df.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32,
            33],
           dtype='int64')

In [20]:
random_df.sort_index()

           0         1         2         3         4
0   0.408873  0.080148  0.722495  0.841586  0.305969
1   0.966075  0.604476  0.723774  0.774487  0.548012
2   0.625200  0.949898  0.618637  0.209370  0.351028
3   0.764264  0.967682  0.860462  0.060047  0.359093
4   0.055418  0.148955  0.953123  0.743903  0.072944
5   0.064436  0.405170  0.472755  0.000539  0.771147
6   0.162364  0.859095  0.197330  0.650121  0.182077
7   0.204036  0.793590  0.457012  0.514447  0.667783
8   0.722857  0.053262  0.568450  0.936718  0.571551
9   0.655874  0.980545  0.847337  0.481531  0.790807
10  0.210434  0.220835  0.556794  0.379235  0.697719
11  0.942312  0.940318  0.642065  0.684616  0.081454
12  0.195407  0.033434  0.199481  0.785866  0.186991
13  0.383217  0.323682  0.170311  0.358346  0.541689
14  0.452334  0.912721  0.047852  0.387939  0.878862
15  0.674105  0.273364  0.187527  0.071850  0.433325
16  0.788113  0.267426  0.739016  0.627038  0.371258
17  0.594546  0.187466  0.354999  0.702020  0.707764
18  0.532293  0.333547  0.513744  0.457036  0.048925
19  0.628971  0.624236  0.500616  0.500585  0.566145
20  0.885316  0.510555  0.283704  0.315664  0.819197
21  0.566729  0.648524  0.665313  0.479573  0.109516
22  0.367752  0.963507  0.181049  0.883034  0.270378
23  0.071512  0.559584  0.416363  0.103755  0.715984
24  0.087940  0.514506  0.593723  0.476755  0.677068
25  0.411591  0.755843  0.602230  0.690597  0.101611
26  0.797402  0.439801  0.696072  0.035736  0.358414
27  0.031095  0.811242  0.903321  0.462740  0.413195
28  0.691195  0.333192  0.413138  0.599887  0.348240
29  0.602075  0.558636  0.920549  0.726632  0.399069
30  0.170402  0.411075  0.551609  0.361438  0.174665
31  0.394684  0.825703  0.743615  0.115180  0.968541
32  0.473905  0.121063  0.975106  0.241134  0.651525
33  0.581369  0.848084  0.388928  0.025997  0.896529

In [21]:
# views in Pandas dataframe.

In [22]:
random_df.loc[0,0] = 1345

In [23]:
random_df.columns = list("ABCDE")

In [24]:
random_df.columns = list("ABCDE")

In [25]:
random_df.head(8)

             A         B         C         D         E
0  1345.000000  0.080148  0.722495  0.841586  0.305969
1     0.966075  0.604476  0.723774  0.774487  0.548012
2     0.625200  0.949898  0.618637  0.209370  0.351028
3     0.764264  0.967682  0.860462  0.060047  0.359093
4     0.055418  0.148955  0.953123  0.743903  0.072944
5     0.064436  0.405170  0.472755  0.000539  0.771147
6     0.162364  0.859095  0.197330  0.650121  0.182077
7     0.204036  0.793590  0.457012  0.514447  0.667783

In [26]:
random_df.loc[6,'E'] = 7896

In [27]:
random_df.iloc[6,1]

0.859095176201349

In [28]:
random_df.iloc[0,1]

0.0801483696229639

In [29]:
random_df.loc[0,'A'] = 1

In [30]:
random_df.drop('E',axis=1,inplace=True)

In [31]:
random_df.head(4)

          A         B         C         D
0  1.000000  0.080148  0.722495  0.841586
1  0.966075  0.604476  0.723774  0.774487
2  0.625200  0.949898  0.618637  0.209370
3  0.764264  0.967682  0.860462  0.060047

In [32]:
random_df.loc[[1,2],['A','C']]

          A         C
1  0.966075  0.723774
2  0.625200  0.618637

In [33]:
random_df.loc[(random_df['B']<0.5) & (random_df['C']>0.7)]

           A         B         C         D
0   1.000000  0.080148  0.722495  0.841586
4   0.055418  0.148955  0.953123  0.743903
16  0.788113  0.267426  0.739016  0.627038
32  0.473905  0.121063  0.975106  0.241134

In [34]:
random_df.iloc[0,2]

0.722495258868057

In [35]:
random_df.head(10)

          A         B         C         D
0  1.000000  0.080148  0.722495  0.841586
1  0.966075  0.604476  0.723774  0.774487
2  0.625200  0.949898  0.618637  0.209370
3  0.764264  0.967682  0.860462  0.060047
4  0.055418  0.148955  0.953123  0.743903
5  0.064436  0.405170  0.472755  0.000539
6  0.162364  0.859095  0.197330  0.650121
7  0.204036  0.793590  0.457012  0.514447
8  0.722857  0.053262  0.568450  0.936718
9  0.655874  0.980545  0.847337  0.481531

In [ ]:
titanic_data = pd.read_csv('train.csv')

In [ ]:
# t1 length 1000 rows Tsecs
# t2 length 100000 rows

In [63]:
titanic_data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [73]:
random_df.head()

             A         B         C         D
0     0.331376  0.986584  0.760436  0.428159
1  1234.000000  0.456498  0.364181  0.356219
2     0.905016  0.748677  0.548486  0.883466
3     0.895005  0.337776  0.806864  0.984157
4     0.123853  0.740471  0.656942  0.236838

In [72]:
random_df.drop('E',axis=1,inplace=True)

In [9]:
random_df['A'].isnull()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
Name: A, dtype: bool

In [10]:
titanic_data = pd.read_csv('train.csv')

In [12]:
titanic_data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [75]:
titanic_data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [85]:
titanic_data[titanic_data.select_dtypes(exclude='number').columns]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [86]:
titanic_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [90]:
titanic_data['Age'].nunique()

88

In [92]:
titanic_data['Fare'].value_counts()

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
8.4583      1
9.8375      1
8.3625      1
14.1083     1
17.4000     1
Name: Fare, Length: 248, dtype: int64

In [17]:
# mean,median,mode,correlation,count,max,min,std

In [96]:
titanic_data[titanic_data.select_dtypes(include='number').columns].mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [97]:
titanic_data[titanic_data.select_dtypes(include='number').columns].median()

PassengerId    446.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Fare            14.4542
dtype: float64

In [98]:
titanic_data[titanic_data.select_dtypes(include='number').columns].max()

PassengerId    891.0000
Survived         1.0000
Pclass           3.0000
Age             80.0000
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

In [116]:
for i in titanic_data[titanic_data.select_dtypes(include='number').columns]:
    print(i,titanic_data[i].mode()[0])

PassengerId 1
Survived 0
Pclass 3
Age 24.0
SibSp 0
Parch 0
Fare 8.05

In [108]:
titanic_data[titanic_data.select_dtypes(include='number').columns].std()

PassengerId    257.353842
Survived         0.486592
Pclass           0.836071
Age             14.526497
SibSp            1.102743
Parch            0.806057
Fare            49.693429
dtype: float64

In [109]:
titanic_data[titanic_data.select_dtypes(include='number').columns].max()

PassengerId    891.0000
Survived         1.0000
Pclass           3.0000
Age             80.0000
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

In [111]:
titanic_data[titanic_data.select_dtypes(include='number').columns].min()

PassengerId    1.00
Survived       0.00
Pclass         1.00
Age            0.42
SibSp          0.00
Parch          0.00
Fare           0.00
dtype: float64

In [117]:
titanic_data[titanic_data.select_dtypes(include='number').columns].corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [19]:
titanic_data['Age'].mean()

29.69911764705882

In [20]:
titanic_data['Age'].median()

28.0

In [21]:
titanic_data['Age'].mode()

0    24.0
dtype: float64

In [134]:
titanic_data.groupby(['Sex']).mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [26]:
titanic_data.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [121]:
titanic_data.dropna(axis=0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [124]:
titanic_data.fillna(0).isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [129]:
titanic_data.groupby

<bound method DataFrame.groupby of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>